:PROPERTIES:
:ID:       F3E6007F-409B-47C4-8881-48BCAE48F81B
:header-args: :results output
:END:
#+title: git

Git is one of the most common (D)VCS solutions.

* Installation

#+begin_src shell
  git --version
#+end_src

#+RESULTS:
: git version 2.50.1 (Apple Git-155)

* Help

#+begin_src shell
  git --help
#+end_src

#+RESULTS:
#+begin_example
usage: git [-v | --version] [-h | --help] [-C <path>] [-c <name>=<value>]
           [--exec-path[=<path>]] [--html-path] [--man-path] [--info-path]
           [-p | --paginate | -P | --no-pager] [--no-replace-objects] [--no-lazy-fetch]
           [--no-optional-locks] [--no-advice] [--bare] [--git-dir=<path>]
           [--work-tree=<path>] [--namespace=<name>] [--config-env=<name>=<envvar>]
           <command> [<args>]

These are common Git commands used in various situations:

start a working area (see also: git help tutorial)
   clone      Clone a repository into a new directory
   init       Create an empty Git repository or reinitialize an existing one

work on the current change (see also: git help everyday)
   add        Add file contents to the index
   mv         Move or rename a file, a directory, or a symlink
   restore    Restore working tree files
   rm         Remove files from the working tree and from the index

examine the history and state (see also: git help revisions)
   bisect     Use binary search to find the commit that introduced a bug
   diff       Show changes between commits, commit and working tree, etc
   grep       Print lines matching a pattern
   log        Show commit logs
   show       Show various types of objects
   status     Show the working tree status

grow, mark and tweak your common history
   backfill   Download missing objects in a partial clone
   branch     List, create, or delete branches
   commit     Record changes to the repository
   merge      Join two or more development histories together
   rebase     Reapply commits on top of another base tip
   reset      Reset current HEAD to the specified state
   switch     Switch branches
   tag        Create, list, delete or verify a tag object signed with GPG

collaborate (see also: git help workflows)
   fetch      Download objects and refs from another repository
   pull       Fetch from and integrate with another repository or a local branch
   push       Update remote refs along with associated objects

'git help -a' and 'git help -g' list available subcommands and some
concept guides. See 'git help <command>' or 'git help <concept>'
to read about a specific subcommand or concept.
See 'git help git' for an overview of the system.
#+end_example

** Subcommands

#+begin_src shell
  git help -a
#+end_src

#+RESULTS:
#+begin_example
See 'git help <command>' to read about a specific subcommand

Main Porcelain Commands
   add                     Add file contents to the index
   am                      Apply a series of patches from a mailbox
   archive                 Create an archive of files from a named tree
   backfill                Download missing objects in a partial clone
   bisect                  Use binary search to find the commit that introduced a bug
   branch                  List, create, or delete branches
   bundle                  Move objects and refs by archive
   checkout                Switch branches or restore working tree files
   cherry-pick             Apply the changes introduced by some existing commits
   citool                  Graphical alternative to git-commit
   clean                   Remove untracked files from the working tree
   clone                   Clone a repository into a new directory
   commit                  Record changes to the repository
   describe                Give an object a human readable name based on an available ref
   diff                    Show changes between commits, commit and working tree, etc
   fetch                   Download objects and refs from another repository
   format-patch            Prepare patches for e-mail submission
   gc                      Cleanup unnecessary files and optimize the local repository
   gitk                    The Git repository browser
   grep                    Print lines matching a pattern
   gui                     A portable graphical interface to Git
   init                    Create an empty Git repository or reinitialize an existing one
   log                     Show commit logs
   maintenance             Run tasks to optimize Git repository data
   merge                   Join two or more development histories together
   mv                      Move or rename a file, a directory, or a symlink
   notes                   Add or inspect object notes
   pull                    Fetch from and integrate with another repository or a local branch
   push                    Update remote refs along with associated objects
   range-diff              Compare two commit ranges (e.g. two versions of a branch)
   rebase                  Reapply commits on top of another base tip
   reset                   Reset current HEAD to the specified state
   restore                 Restore working tree files
   revert                  Revert some existing commits
   rm                      Remove files from the working tree and from the index
   scalar                  A tool for managing large Git repositories
   shortlog                Summarize 'git log' output
   show                    Show various types of objects
   sparse-checkout         Reduce your working tree to a subset of tracked files
   stash                   Stash the changes in a dirty working directory away
   status                  Show the working tree status
   submodule               Initialize, update or inspect submodules
   switch                  Switch branches
   tag                     Create, list, delete or verify a tag object signed with GPG
   worktree                Manage multiple working trees

Ancillary Commands / Manipulators
   config                  Get and set repository or global options
   fast-export             Git data exporter
   fast-import             Backend for fast Git data importers
   filter-branch           Rewrite branches
   mergetool               Run merge conflict resolution tools to resolve merge conflicts
   pack-refs               Pack heads and tags for efficient repository access
   prune                   Prune all unreachable objects from the object database
   reflog                  Manage reflog information
   refs                    Low-level access to refs
   remote                  Manage set of tracked repositories
   repack                  Pack unpacked objects in a repository
   replace                 Create, list, delete refs to replace objects

Ancillary Commands / Interrogators
   annotate                Annotate file lines with commit information
   blame                   Show what revision and author last modified each line of a file
   bugreport               Collect information for user to file a bug report
   count-objects           Count unpacked number of objects and their disk consumption
   diagnose                Generate a zip archive of diagnostic information
   difftool                Show changes using common diff tools
   fsck                    Verifies the connectivity and validity of the objects in the database
   gitweb                  Git web interface (web frontend to Git repositories)
   help                    Display help information about Git
   instaweb                Instantly browse your working repository in gitweb
   merge-tree              Perform merge without touching index or working tree
   rerere                  Reuse recorded resolution of conflicted merges
   show-branch             Show branches and their commits
   verify-commit           Check the GPG signature of commits
   verify-tag              Check the GPG signature of tags
   version                 Display version information about Git
   whatchanged             Show logs with differences each commit introduces

Interacting with Others
   archimport              Import a GNU Arch repository into Git
   cvsexportcommit         Export a single commit to a CVS checkout
   cvsimport               Salvage your data out of another SCM people love to hate
   cvsserver               A CVS server emulator for Git
   imap-send               Send a collection of patches from stdin to an IMAP folder
   p4                      Import from and submit to Perforce repositories
   quiltimport             Applies a quilt patchset onto the current branch
   request-pull            Generates a summary of pending changes
   send-email              Send a collection of patches as emails
   svn                     Bidirectional operation between a Subversion repository and Git

Low-level Commands / Manipulators
   apply                   Apply a patch to files and/or to the index
   checkout-index          Copy files from the index to the working tree
   commit-graph            Write and verify Git commit-graph files
   commit-tree             Create a new commit object
   hash-object             Compute object ID and optionally create an object from a file
   index-pack              Build pack index file for an existing packed archive
   merge-file              Run a three-way file merge
   merge-index             Run a merge for files needing merging
   mktag                   Creates a tag object with extra validation
   mktree                  Build a tree-object from ls-tree formatted text
   multi-pack-index        Write and verify multi-pack-indexes
   pack-objects            Create a packed archive of objects
   prune-packed            Remove extra objects that are already in pack files
   read-tree               Reads tree information into the index
   replay                  EXPERIMENTAL: Replay commits on a new base, works with bare repos too
   symbolic-ref            Read, modify and delete symbolic refs
   unpack-objects          Unpack objects from a packed archive
   update-index            Register file contents in the working tree to the index
   update-ref              Update the object name stored in a ref safely
   write-tree              Create a tree object from the current index

Low-level Commands / Interrogators
   cat-file                Provide contents or details of repository objects
   cherry                  Find commits yet to be applied to upstream
   diff-files              Compares files in the working tree and the index
   diff-index              Compare a tree to the working tree or index
   diff-pairs              Compare the content and mode of provided blob pairs
   diff-tree               Compares the content and mode of blobs found via two tree objects
   for-each-ref            Output information on each ref
   for-each-repo           Run a Git command on a list of repositories
   get-tar-commit-id       Extract commit ID from an archive created using git-archive
   ls-files                Show information about files in the index and the working tree
   ls-remote               List references in a remote repository
   ls-tree                 List the contents of a tree object
   merge-base              Find as good common ancestors as possible for a merge
   name-rev                Find symbolic names for given revs
   pack-redundant          Find redundant pack files
   rev-list                Lists commit objects in reverse chronological order
   rev-parse               Pick out and massage parameters
   show-index              Show packed archive index
   show-ref                List references in a local repository
   unpack-file             Creates a temporary file with a blob's contents
   var                     Show a Git logical variable
   verify-pack             Validate packed Git archive files

Low-level Commands / Syncing Repositories
   daemon                  A really simple server for Git repositories
   fetch-pack              Receive missing objects from another repository
   http-backend            Server side implementation of Git over HTTP
   send-pack               Push objects over Git protocol to another repository
   update-server-info      Update auxiliary info file to help dumb servers

Low-level Commands / Internal Helpers
   check-attr              Display gitattributes information
   check-ignore            Debug gitignore / exclude files
   check-mailmap           Show canonical names and email addresses of contacts
   check-ref-format        Ensures that a reference name is well formed
   column                  Display data in columns
   credential              Retrieve and store user credentials
   credential-cache        Helper to temporarily store passwords in memory
   credential-store        Helper to store credentials on disk
   fmt-merge-msg           Produce a merge commit message
   hook                    Run git hooks
   interpret-trailers      Add or parse structured information in commit messages
   mailinfo                Extracts patch and authorship from a single e-mail message
   mailsplit               Simple UNIX mbox splitter program
   merge-one-file          The standard helper program to use with git-merge-index
   patch-id                Compute unique ID for a patch
   sh-i18n                 Git's i18n setup code for shell scripts
   sh-setup                Common Git shell script setup code
   stripspace              Remove unnecessary whitespace

User-facing repository, command and file interfaces
   attributes              Defining attributes per path
   cli                     Git command-line interface and conventions
   hooks                   Hooks used by Git
   ignore                  Specifies intentionally untracked files to ignore
   mailmap                 Map author/committer names and/or E-Mail addresses
   modules                 Defining submodule properties
   repository-layout       Git Repository Layout
   revisions               Specifying revisions and ranges for Git

Developer-facing file formats, protocols and other interfaces
   format-bundle           The bundle file format
   format-chunk            Chunk-based file formats
   format-commit-graph     Git commit-graph format
   format-index            Git index format
   format-pack             Git pack format
   format-signature        Git cryptographic signature formats
   protocol-capabilities   Protocol v0 and v1 capabilities
   protocol-common         Things common to various protocols
   protocol-http           Git HTTP-based protocols
   protocol-pack           How packs are transferred over-the-wire
   protocol-v2             Git Wire Protocol, Version 2
#+end_example

* Add

** Help

#+begin_src shell
  git add --help
#+end_src

#+RESULTS:
#+begin_example
GIT-ADD(1)                        Git Manual                        GIT-ADD(1)

NNAAMMEE
       git-add - Add file contents to the index

SSYYNNOOPPSSIISS
       ggiitt aadddd [----vveerrbboossee | --vv] [----ddrryy--rruunn | --nn] [----ffoorrccee | --ff] [----iinntteerraaccttiivvee | --ii] [----ppaattcchh | --pp]
            [----eeddiitt | --ee] [----[nnoo--]aallll | --AA | ----[nnoo--]iiggnnoorree--rreemmoovvaall | [----uuppddaattee | --uu]] [----ssppaarrssee]
            [----iinntteenntt--ttoo--aadddd | --NN] [----rreeffrreesshh] [----iiggnnoorree--eerrrroorrss] [----iiggnnoorree--mmiissssiinngg] [----rreennoorrmmaalliizzee]
            [----cchhmmoodd==(++|--)xx] [----ppaatthhssppeecc--ffrroomm--ffiillee==_<_f_i_l_e_> [----ppaatthhssppeecc--ffiillee--nnuull]]
            [----] [_<_p_a_t_h_s_p_e_c_>...]

DDEESSCCRRIIPPTTIIOONN
       This command updates the index using the current content found in the
       working tree, to prepare the content staged for the next commit. It
       typically adds the current content of existing paths as a whole, but
       with some options it can also be used to add content with only part of
       the changes made to the working tree files applied, or remove paths
       that do not exist in the working tree anymore.

       The "index" holds a snapshot of the content of the working tree, and it
       is this snapshot that is taken as the contents of the next commit. Thus
       after making any changes to the working tree, and before running the
       commit command, you must use the aadddd command to add any new or modified
       files to the index.

       This command can be performed multiple times before a commit. It only
       adds the content of the specified file(s) at the time the add command
       is run; if you want subsequent changes included in the next commit,
       then you must run ggiitt aadddd again to add the new content to the index.

       The ggiitt ssttaattuuss command can be used to obtain a summary of which files
       have changes that are staged for the next commit.

       The ggiitt aadddd command will not add ignored files by default. If any
       ignored files were explicitly specified on the command line, ggiitt aadddd
       will fail with a list of ignored files. Ignored files reached by
       directory recursion or filename globbing performed by Git (quote your
       globs before the shell) will be silently ignored. The ggiitt aadddd command
       can be used to add ignored files with the --ff (force) option.

       Please see ggiitt--ccoommmmiitt(1) for alternative ways to add content to a
       commit.

OOPPTTIIOONNSS
       _<_p_a_t_h_s_p_e_c_>...
           Files to add content from. Fileglobs (e.g.  **..cc) can be given to
           add all matching files. Also a leading directory name (e.g.  ddiirr to
           add ddiirr//ffiillee11 and ddiirr//ffiillee22) can be given to update the index to
           match the current state of the directory as a whole (e.g.
           specifying ddiirr will record not just a file ddiirr//ffiillee11 modified in
           the working tree, a file ddiirr//ffiillee22 added to the working tree, but
           also a file ddiirr//ffiillee33 removed from the working tree). Note that
           older versions of Git used to ignore removed files; use ----nnoo--aallll
           option if you want to add modified or new files but ignore removed
           ones.

           For more details about the _<_p_a_t_h_s_p_e_c_> syntax, see the _p_a_t_h_s_p_e_c
           entry in ggiittgglloossssaarryy(7).

       --nn, ----ddrryy--rruunn
           Don’t actually add the file(s), just show if they exist and/or will
           be ignored.

       --vv, ----vveerrbboossee
           Be verbose.

       --ff, ----ffoorrccee
           Allow adding otherwise ignored files.

       ----ssppaarrssee
           Allow updating index entries outside of the sparse-checkout cone.
           Normally, ggiitt aadddd refuses to update index entries whose paths do
           not fit within the sparse-checkout cone, since those files might be
           removed from the working tree without warning. See ggiitt--ssppaarrssee--
           cchheecckkoouutt(1) for more details.

       --ii, ----iinntteerraaccttiivvee
           Add modified contents in the working tree interactively to the
           index. Optional path arguments may be supplied to limit operation
           to a subset of the working tree. See “Interactive mode” for
           details.

       --pp, ----ppaattcchh
           Interactively choose hunks of patch between the index and the work
           tree and add them to the index. This gives the user a chance to
           review the difference before adding modified contents to the index.

           This effectively runs aadddd ----iinntteerraaccttiivvee, but bypasses the initial
           command menu and directly jumps to the ppaattcchh subcommand. See
           “Interactive mode” for details.

       --ee, ----eeddiitt
           Open the diff vs. the index in an editor and let the user edit it.
           After the editor was closed, adjust the hunk headers and apply the
           patch to the index.

           The intent of this option is to pick and choose lines of the patch
           to apply, or even to modify the contents of lines to be staged.
           This can be quicker and more flexible than using the interactive
           hunk selector. However, it is easy to confuse oneself and create a
           patch that does not apply to the index. See EDITING PATCHES below.

       --uu, ----uuppddaattee
           Update the index just where it already has an entry matching
           _<_p_a_t_h_s_p_e_c_>. This removes as well as modifies index entries to match
           the working tree, but adds no new files.

           If no _<_p_a_t_h_s_p_e_c_> is given when --uu option is used, all tracked files
           in the entire working tree are updated (old versions of Git used to
           limit the update to the current directory and its subdirectories).

       --AA, ----aallll, ----nnoo--iiggnnoorree--rreemmoovvaall
           Update the index not only where the working tree has a file
           matching _<_p_a_t_h_s_p_e_c_> but also where the index already has an entry.
           This adds, modifies, and removes index entries to match the working
           tree.

           If no _<_p_a_t_h_s_p_e_c_> is given when --AA option is used, all files in the
           entire working tree are updated (old versions of Git used to limit
           the update to the current directory and its subdirectories).

       ----nnoo--aallll, ----iiggnnoorree--rreemmoovvaall
           Update the index by adding new files that are unknown to the index
           and files modified in the working tree, but ignore files that have
           been removed from the working tree. This option is a no-op when no
           _<_p_a_t_h_s_p_e_c_> is used.

           This option is primarily to help users who are used to older
           versions of Git, whose ggiitt aadddd _<_p_a_t_h_s_p_e_c_>... was a synonym for ggiitt
           aadddd ----nnoo--aallll _<_p_a_t_h_s_p_e_c_>..., i.e. ignored removed files.

       --NN, ----iinntteenntt--ttoo--aadddd
           Record only the fact that the path will be added later. An entry
           for the path is placed in the index with no content. This is useful
           for, among other things, showing the unstaged content of such files
           with ggiitt ddiiffff and committing them with ggiitt ccoommmmiitt --aa.

       ----rreeffrreesshh
           Don’t add the file(s), but only refresh their stat() information in
           the index.

       ----iiggnnoorree--eerrrroorrss
           If some files could not be added because of errors indexing them,
           do not abort the operation, but continue adding the others. The
           command shall still exit with non-zero status. The configuration
           variable aadddd..iiggnnoorreeEErrrroorrss can be set to true to make this the
           default behaviour.

       ----iiggnnoorree--mmiissssiinngg
           This option can only be used together with ----ddrryy--rruunn. By using this
           option the user can check if any of the given files would be
           ignored, no matter if they are already present in the work tree or
           not.

       ----nnoo--wwaarrnn--eemmbbeeddddeedd--rreeppoo
           By default, ggiitt aadddd will warn when adding an embedded repository to
           the index without using ggiitt ssuubbmmoodduullee aadddd to create an entry in
           .ggiittmmoodduulleess. This option will suppress the warning (e.g., if you
           are manually performing operations on submodules).

       ----rreennoorrmmaalliizzee
           Apply the "clean" process freshly to all tracked files to forcibly
           add them again to the index. This is useful after changing
           ccoorree..aauuttooccrrllff configuration or the tteexxtt attribute in order to
           correct files added with wrong _C_R_L_F_/_L_F line endings. This option
           implies --uu. Lone CR characters are untouched, thus while a _C_R_L_F
           cleans to _L_F, a _C_R_C_R_L_F sequence is only partially cleaned to _C_R_L_F.

       ----cchhmmoodd==(++|--)xx
           Override the executable bit of the added files. The executable bit
           is only changed in the index, the files on disk are left unchanged.

       ----ppaatthhssppeecc--ffrroomm--ffiillee==_<_f_i_l_e_>
           Pathspec is passed in _<_f_i_l_e_> instead of commandline args. If _<_f_i_l_e_>
           is exactly -- then standard input is used. Pathspec elements are
           separated by _L_F or _C_R_/_L_F. Pathspec elements can be quoted as
           explained for the configuration variable ccoorree..qquuootteePPaatthh (see ggiitt--
           ccoonnffiigg(1)). See also ----ppaatthhssppeecc--ffiillee--nnuull and global
           ----lliitteerraall--ppaatthhssppeeccss.

       ----ppaatthhssppeecc--ffiillee--nnuull
           Only meaningful with ----ppaatthhssppeecc--ffrroomm--ffiillee. Pathspec elements are
           separated with _N_U_L character and all other characters are taken
           literally (including newlines and quotes).

       ----
           This option can be used to separate command-line options from the
           list of files, (useful when filenames might be mistaken for
           command-line options).

EEXXAAMMPPLLEESS
       •   Adds content from all **..ttxxtt files under DDooccuummeennttaattiioonn directory and
           its subdirectories:

               $ git add Documentation/\*.txt

           Note that the asterisk ** is quoted from the shell in this example;
           this lets the command include the files from subdirectories of
           DDooccuummeennttaattiioonn// directory.

       •   Considers adding content from all ggiitt--**..sshh scripts:

               $ git add git-*.sh

           Because this example lets the shell expand the asterisk (i.e. you
           are listing the files explicitly), it does not consider
           ssuubbddiirr//ggiitt--ffoooo..sshh.

IINNTTEERRAACCTTIIVVEE MMOODDEE
       When the command enters the interactive mode, it shows the output of
       the _s_t_a_t_u_s subcommand, and then goes into its interactive command loop.

       The command loop shows the list of subcommands available, and gives a
       prompt "What now> ". In general, when the prompt ends with a single _>,
       you can pick only one of the choices given and type return, like this:

               ,*** Commands ***
                 1: status       2: update       3: revert       4: add untracked
                 5: patch        6: diff         7: quit         8: help
               What now> 1

       You also could say ss or ssttaa or ssttaattuuss above as long as the choice is
       unique.

       The main command loop has 6 subcommands (plus help and quit).

       status
           This shows the change between HHEEAADD and index (i.e. what will be
           committed if you say ggiitt ccoommmmiitt), and between index and working
           tree files (i.e. what you could stage further before ggiitt ccoommmmiitt
           using ggiitt aadddd) for each path. A sample output looks like this:

                             staged     unstaged path
                    1:       binary      nothing foo.png
                    2:     +403/-35        +1/-1 add-interactive.c

           It shows that ffoooo..ppnngg has differences from HHEEAADD (but that is binary
           so line count cannot be shown) and there is no difference between
           indexed copy and the working tree version (if the working tree
           version were also different, _b_i_n_a_r_y would have been shown in place
           of _n_o_t_h_i_n_g). The other file, aadddd--iinntteerraaccttiivvee..cc, has 403 lines added
           and 35 lines deleted if you commit what is in the index, but
           working tree file has further modifications (one addition and one
           deletion).

       update
           This shows the status information and issues an "Update>>" prompt.
           When the prompt ends with double _>_>, you can make more than one
           selection, concatenated with whitespace or comma. Also you can say
           ranges. E.g. "2-5 7,9" to choose 2,3,4,5,7,9 from the list. If the
           second number in a range is omitted, all remaining patches are
           taken. E.g. "7-" to choose 7,8,9 from the list. You can say _* to
           choose everything.

           What you chose are then highlighted with _*, like this:

                          staged     unstaged path
                 1:       binary      nothing foo.png
               ,* 2:     +403/-35        +1/-1 add-interactive.c

           To remove selection, prefix the input with -- like this:

               Update>> -2

           After making the selection, answer with an empty line to stage the
           contents of working tree files for selected paths in the index.

       revert
           This has a very similar UI to _u_p_d_a_t_e, and the staged information
           for selected paths are reverted to that of the HEAD version.
           Reverting new paths makes them untracked.

       add untracked
           This has a very similar UI to _u_p_d_a_t_e and _r_e_v_e_r_t, and lets you add
           untracked paths to the index.

       patch
           This lets you choose one path out of a _s_t_a_t_u_s like selection. After
           choosing the path, it presents the diff between the index and the
           working tree file and asks you if you want to stage the change of
           each hunk. You can select one of the following options and type
           return:

               y - stage this hunk
               n - do not stage this hunk
               q - quit; do not stage this hunk or any of the remaining ones
               a - stage this hunk and all later hunks in the file
               d - do not stage this hunk or any of the later hunks in the file
               g - select a hunk to go to
               / - search for a hunk matching the given regex
               j - leave this hunk undecided, see next undecided hunk
               J - leave this hunk undecided, see next hunk
               k - leave this hunk undecided, see previous undecided hunk
               K - leave this hunk undecided, see previous hunk
               s - split the current hunk into smaller hunks
               e - manually edit the current hunk
               p - print the current hunk
               ? - print help

           After deciding the fate for all hunks, if there is any hunk that
           was chosen, the index is updated with the selected hunks.

           You can omit having to type return here, by setting the
           configuration variable iinntteerraaccttiivvee..ssiinngglleeKKeeyy to ttrruuee.

       diff
           This lets you review what will be committed (i.e. between HHEEAADD and
           index).

EEDDIITTIINNGG PPAATTCCHHEESS
       Invoking ggiitt aadddd --ee or selecting ee from the interactive hunk selector
       will open a patch in your editor; after the editor exits, the result is
       applied to the index. You are free to make arbitrary changes to the
       patch, but note that some changes may have confusing results, or even
       result in a patch that cannot be applied. If you want to abort the
       operation entirely (i.e., stage nothing new in the index), simply
       delete all lines of the patch. The list below describes some common
       things you may see in a patch, and which editing operations make sense
       on them.

       added content
           Added content is represented by lines beginning with "+". You can
           prevent staging any addition lines by deleting them.

       removed content
           Removed content is represented by lines beginning with "-". You can
           prevent staging their removal by converting the "-" to a " "
           (space).

       modified content
           Modified content is represented by "-" lines (removing the old
           content) followed by "+" lines (adding the replacement content).
           You can prevent staging the modification by converting "-" lines to
           " ", and removing "+" lines. Beware that modifying only half of the
           pair is likely to introduce confusing changes to the index.

       There are also more complex operations that can be performed. But
       beware that because the patch is applied only to the index and not the
       working tree, the working tree will appear to "undo" the change in the
       index. For example, introducing a new line into the index that is in
       neither the HHEEAADD nor the working tree will stage the new line for
       commit, but the line will appear to be reverted in the working tree.

       Avoid using these constructs, or do so with extreme caution.

       removing untouched content
           Content which does not differ between the index and working tree
           may be shown on context lines, beginning with a " " (space). You
           can stage context lines for removal by converting the space to a
           "-". The resulting working tree file will appear to re-add the
           content.

       modifying existing content
           One can also modify context lines by staging them for removal (by
           converting " " to "-") and adding a "+" line with the new content.
           Similarly, one can modify "+" lines for existing additions or
           modifications. In all cases, the new modification will appear
           reverted in the working tree.

       new content
           You may also add new content that does not exist in the patch;
           simply add new lines, each starting with "+". The addition will
           appear reverted in the working tree.

       There are also several operations which should be avoided entirely, as
       they will make the patch impossible to apply:

       •   adding context (" ") or removal ("-") lines

       •   deleting context or removal lines

       •   modifying the contents of context or removal lines

CCOONNFFIIGGUURRAATTIIOONN
       Everything below this line in this section is selectively included from
       the ggiitt--ccoonnffiigg(1) documentation. The content is the same as what’s
       found there:

       aadddd..iiggnnoorreeEErrrroorrss, aadddd..iiggnnoorree--eerrrroorrss (deprecated)
           Tells ggiitt aadddd to continue adding files when some files cannot be
           added due to indexing errors. Equivalent to the ----iiggnnoorree--eerrrroorrss
           option.  aadddd..iiggnnoorree--eerrrroorrss is deprecated, as it does not follow the
           usual naming convention for configuration variables.

SSEEEE AALLSSOO
       ggiitt--ssttaattuuss(1) ggiitt--rrmm(1) ggiitt--rreesseett(1) ggiitt--mmvv(1) ggiitt--ccoommmmiitt(1) ggiitt--
       uuppddaattee--iinnddeexx(1)

GGIITT
       Part of the ggiitt(1) suite

Git 2.50.1.428.g0e8243            2025-07-22                        GIT-ADD(1)
#+end_example


